Repository: JiatangDong/openkoto
Catalog: openkoto-ios/Packages/OpenKotoKit/Sources/OKLocalization/Resources/Localizable.xcstrings
Source language: en
Languages: ja, zh_hans

# settings.appearance.theme
source: Theme
ja: テーマ
zh_hans: 主题

# settings.data
source: Data
ja: データ
zh_hans: 数据

# settings.data.count.added
source: added
ja: 追加
zh_hans: 新增

# settings.data.count.skippedDeleted
source: skipped, deleted here
ja: 削除済みのためスキップ
zh_hans: 跳过·已删除

# settings.data.count.skippedLocalNewer
source: skipped, newer here
ja: こちらが新しいためスキップ
zh_hans: 跳过·本地更新

# settings.data.count.updated
source: updated
ja: 更新
zh_hans: 更新

# settings.data.entity.articles
source: Articles
ja: 記事
zh_hans: 文章

# settings.data.entity.explanations
source: Explanations
ja: 精読解説
zh_hans: 精讲

# settings.data.entity.packs
source: Word packs
ja: 単語帳
zh_hans: 词包

# settings.data.entity.reviews
source: Review history
ja: 復習履歴
zh_hans: 复习记录

# settings.data.error.appTooOld
source: This file was made by a newer version of OpenKoto. The file is unchanged — update the app and try again.
ja: このファイルは新しいバージョンの OpenKoto で作られています。ファイルはそのままです。アプリを更新してからもう一度お試しください。
zh_hans: 这个文件是更新版本的 OpenKoto 生成的。文件没有被改动——升级 App 后再导入即可。

# settings.data.error.notBundle
source: That is not an OpenKoto data file. Word packs (.okpack.json) are imported from the vocabulary screen instead.
ja: OpenKoto のデータファイルではありません。単語帳（.okpack.json）は単語帳画面から読み込んでください。
zh_hans: 这不是 OpenKoto 的数据文件。词包（.okpack.json）请在生词本页面导入。

# settings.data.error.unreadable
source: That file could not be read.
ja: そのファイルを読み取れませんでした。
zh_hans: 读不了这个文件。

# settings.data.export
source: Export my data
ja: データを書き出す
zh_hans: 导出我的数据

# settings.data.footer
source: Your iPhone, iPad and Mac sync automatically over iCloud. Use import to bring in material prepared in the desktop app, and export to take your data with you.
ja: iPhone・iPad・Mac は iCloud で自動同期されます。読み込みはデスクトップ版で用意した素材を取り込むため、書き出しはデータを持ち出すためのものです。
zh_hans: iPhone、iPad 与 Mac 之间会经 iCloud 自动同步。导入用于把桌面版加工好的素材拿进来，导出用于带走你自己的数据。

# settings.data.import
source: Import from file
ja: ファイルから読み込む
zh_hans: 从文件导入

# settings.data.import.done
source: Import finished
ja: 読み込み完了
zh_hans: 导入完成

# settings.data.import.failed
source: Import failed
ja: 読み込みに失敗しました
zh_hans: 导入失败

# settings.data.import.nothingNew
source: Everything in this file is already on this device.
ja: このファイルの内容はすべて、このデバイスに既にあります。
zh_hans: 这个文件里的内容，这台设备上都已经有了。

# settings.data.includeContent
source: Include articles and explanations
ja: 記事と精読解説を含める
zh_hans: 包含文章与精讲

# settings.explanationLanguage
source: Explanation Language
ja: 解説言語
zh_hans: 讲解语言

# settings.interfaceLanguage
source: Interface Language
ja: 表示言語
zh_hans: 界面语言

# settings.interfaceLanguage.system
source: Follow System
ja: システムに従う
zh_hans: 跟随系统

# settings.language
source: Language
ja: 言語
zh_hans: 语言

# settings.language.footer
source: Interface Language changes the app's own menus and buttons. Explanation Language is the language the AI writes explanations and translations in.
ja: 表示言語はアプリのメニューやボタンの言語、解説言語は AI が解説・翻訳を書く言語です。
zh_hans: 界面语言决定 App 菜单与按钮的显示语言；讲解语言决定 AI 生成精讲与翻译所用的语言。

# settings.learning
source: Learning
ja: 学習
zh_hans: 学习

# settings.learning.batchConcurrency
source: Batch Concurrency
ja: 一括処理の並列数
zh_hans: 批量并发数

# settings.learning.targetLanguage
source: Target Language
ja: 目標言語
zh_hans: 目标语言

# settings.models
source: AI Models
ja: AI モデル
zh_hans: AI 模型

# settings.models.add
source: Add Model
ja: モデルを追加
zh_hans: 添加模型

# settings.models.edit
source: Edit Model
ja: モデルを編集
zh_hans: 编辑模型

# settings.models.none
source: No model configured. BYOK: add your own API key.
ja: モデル未設定。BYOK：自分の API キーを追加してください。
zh_hans: 尚未配置模型。BYOK：填入你自己的 API Key。

# settings.privacy
source: Privacy & Data
ja: プライバシーとデータ
zh_hans: 隐私与数据

# settings.privacy.note
source: Article text is sent to your chosen AI provider only after you authorize it.
ja: 本文は許可後にのみ選択した AI プロバイダーへ送信されます。
zh_hans: 文章正文仅在你授权后才会发送给所选 AI 服务商。

# settings.replayOnboarding
source: Replay Welcome Guide
ja: ガイドをもう一度見る
zh_hans: 重新查看引导

# settings.replayOnboarding.footer
source: Walk through the intro and setup again. Nothing you saved is removed.
ja: 紹介と初期設定をもう一度確認できます。保存済みのデータは消えません。
zh_hans: 重新走一遍功能介绍与初始设置。已保存的内容不会被清除。

# settings.review
source: Review
ja: 復習
zh_hans: 复习

# settings.review.dailyNew
source: Daily New Limit
ja: 1日の新規上限
zh_hans: 每日新学上限

# settings.review.dailyReview
source: Daily Review Limit
ja: 1日の復習上限
zh_hans: 每日复习上限

# settings.review.retention
source: Target Retention
ja: 目標保持率
zh_hans: 期望保持率

# settings.sync
source: iCloud Sync
ja: iCloud 同期
zh_hans: iCloud 同步

# settings.sync.footer
source: Words, review progress, explanations, book text, subtitles and highlights sync between your iPhone, iPad and Mac through your own iCloud account. Book and video files stay on each device, so on other devices you can read and study the text but not open the original file. The first sync may take a while.
ja: 単語・復習の進捗・精読解説・書籍本文・字幕・ハイライトを、ご自身の iCloud アカウント経由で iPhone・iPad・Mac 間で同期します。書籍と動画のファイル自体は各デバイスに残るため、他のデバイスではテキストの学習はできますが原本は開けません。初回の同期には時間がかかることがあります。
zh_hans: 生词、复习进度、精讲、书籍正文、字幕与划线会经你自己的 iCloud 账号在 iPhone、iPad 与 Mac 之间同步。书籍与视频文件留在各自设备上，所以在别的设备上文本能读能学，但打不开原文件。首次同步可能较久。

# settings.sync.lastSynced
source: Last synced %@
ja: 最終同期 %@
zh_hans: 上次同步 %@

# settings.sync.now
source: Sync now
ja: 今すぐ同期
zh_hans: 立即同步

# settings.sync.resync
source: Re-download everything
ja: すべて取得し直す
zh_hans: 重新拉取全部数据

# settings.sync.status.failed
source: Sync failed
ja: 同期に失敗しました
zh_hans: 同步失败

# settings.sync.status.never
source: Not synced yet
ja: 未同期
zh_hans: 尚未同步

# settings.sync.status.syncing
source: Syncing…
ja: 同期中…
zh_hans: 同步中…

# settings.sync.status.unavailable
source: Sign in to iCloud to sync.
ja: 同期するには iCloud にサインインしてください。
zh_hans: 登录 iCloud 后才能同步。

# settings.sync.toggle
source: Sync with iCloud
ja: iCloud で同期
zh_hans: 用 iCloud 同步

# source.notExplained
source: This sentence has not been explained yet. Open it in the text to explain it.
ja: この文はまだ解説されていません。本文で開くと解説できます。
zh_hans: 这一句还没有精讲。回到原文即可精讲它。

# source.openInText
source: Open in text
ja: 本文で開く
zh_hans: 在原文中查看

# source.sentenceUnavailable
source: The original sentence can no longer be located — this chapter has been re-split since. You can still open the text.
ja: 元の文が見つかりません。この章は再分割されています。本文を開くことはできます。
zh_hans: 找不到当时那一句了——这一章之后被重新切分过。仍然可以打开原文。

# source.title
source: Source
ja: 出典
zh_hans: 出处

# source.unavailable
source: This card has no source. Words saved from a sentence remember where they came from.
ja: このカードには出典がありません。文から保存した単語には出典が記録されます。
zh_hans: 这张卡片没有出处。从句子里收藏的词会记住它出自哪里。

# stats.empty.activity
source: No review history yet
ja: 復習履歴がありません
zh_hans: 还没有复习记录

# stats.empty.forecast
source: Nothing scheduled
ja: 予定なし
zh_hans: 暂无待复习

# stats.empty.message
source: Read and review to see your progress here.
ja: 読んで復習すると、ここに学習の進捗が表示されます。
zh_hans: 阅读并复习后，这里会显示你的学习进度。

# stats.empty.reading
source: No reading time yet
ja: 読書時間がありません
zh_hans: 还没有阅读时长

# stats.empty.retention
source: No reviewed cards yet
ja: 復習済みのカードがありません
zh_hans: 还没有复习过的卡片

# stats.empty.states
source: No words yet
ja: 単語がありません
zh_hans: 还没有生词

# stats.empty.title
source: No stats yet
ja: まだ統計がありません
zh_hans: 还没有统计

# stats.grade.again
source: Again
ja: もう一度
zh_hans: 重来

# stats.grade.easy
source: Easy
ja: 簡単
zh_hans: 简单

# stats.grade.good
source: Good
ja: 普通
zh_hans: 良好

# stats.grade.hard
source: Hard
ja: 難しい
zh_hans: 困难

# stats.legend.new
source: New
ja: 新規
zh_hans: 新学

# stats.legend.review
source: Review
ja: 復習
zh_hans: 复习

# stats.metric.activeDays
source: Active Days
ja: 学習日数
zh_hans: 活跃天数

# stats.metric.reviews
source: Reviews
ja: 復習
zh_hans: 复习

# stats.metric.words
source: Words
ja: 単語
zh_hans: 生词

# stats.reading.monthDays
source: Days this month
ja: 今月の日数
zh_hans: 本月天数

# stats.reading.todayMinutes
source: Today (min)
ja: 今日(分)
zh_hans: 今日(分钟)

# stats.reading.totalMinutes
source: Total (min)
ja: 累計(分)
zh_hans: 累计(分钟)

# stats.retention.fading
source: Fading
ja: 減衰中
zh_hans: 正在衰减

# stats.retention.strong
source: Strong
ja: 良好
zh_hans: 保持良好

# stats.retention.weak
source: Weak
ja: 忘却の恐れ
zh_hans: 可能遗忘

# stats.section.achievements
source: Achievements
ja: 実績
zh_hans: 成就

# stats.section.activity
source: Review Activity
ja: 復習アクティビティ
zh_hans: 复习活跃度

# stats.section.forecast
source: Due Forecast
ja: 復習予定
zh_hans: 复习预测

# stats.section.grades
source: Grade Mix
ja: 評価の内訳
zh_hans: 评分分布

# stats.section.reading
source: Reading Time
ja: 読書時間
zh_hans: 阅读时长

# stats.section.retention
source: Retention
ja: 記憶保持
zh_hans: 记忆保持

# stats.section.states
source: Card States
ja: カードの状態
zh_hans: 卡片状态

# tab.library
source: Library
ja: ライブラリ
zh_hans: 资源

# tab.settings
source: Settings
ja: 設定
zh_hans: 设置

# tab.statistics
source: Statistics
ja: 統計
zh_hans: 统计

# tab.vocabulary
source: Vocabulary
ja: 単語帳
zh_hans: 生词本

# vocab.backToSource
source: Go to sentence
ja: 元の文へ
zh_hans: 回到原句

# vocabulary.addWord
source: Add Word
ja: 単語を追加
zh_hans: 添加单词

# vocabulary.deletePackAction
source: Delete Pack
ja: パックを削除
zh_hans: 删除合集

# vocabulary.deletePackConfirm
source: Delete this pack?
ja: このパックを削除しますか?
zh_hans: 确定删除合集吗?

# vocabulary.deletePackMessage
source: Words that belong to no other pack will be moved to Ungrouped.
ja: 他のパックに属さない単語は「未分類」に移動します。
zh_hans: 不属于其他合集的单词将移入“未分组”。

# vocabulary.dueToday
source: Due Today
ja: 今日の復習
zh_hans: 今日到期

# vocabulary.duplicateWord
source: This word already exists — edit the existing card instead
ja: 同じ単語が既に存在します。既存のカードを編集してください
zh_hans: 已存在相同单词,请直接编辑原有卡片

# vocabulary.editWord
source: Edit Word
ja: 単語を編集
zh_hans: 编辑单词

# vocabulary.empty
source: Words you star while reading will appear here.
ja: 読書中にお気に入りにした単語がここに表示されます。
zh_hans: 阅读时收藏的生词会出现在这里。

# vocabulary.favorite
source: Save to vocabulary
ja: 単語帳に保存
zh_hans: 收藏到生词本

# vocabulary.fieldExample
source: Example (optional)
ja: 例文(任意)
zh_hans: 例句(可选)

# vocabulary.fieldMeaning
source: Meaning
ja: 意味
zh_hans: 释义

# vocabulary.fieldPacks
source: Packs
ja: パック
zh_hans: 所属合集

# vocabulary.fieldReading
source: Reading (optional)
ja: 読み(任意)
zh_hans: 读音(可选)

# vocabulary.fieldUsage
source: Usage (optional)
ja: 用法(任意)
zh_hans: 用法(可选)

# vocabulary.fieldWord
source: Word
ja: 単語
zh_hans: 单词

# vocabulary.markMastered
source: Mastered
ja: 習得済みにする
zh_hans: 标记已掌握

# vocabulary.newPack
source: New Pack
ja: 新しいパック
zh_hans: 新建合集

# vocabulary.newPackPrompt
source: Enter a new pack name
ja: 新しいパック名を入力
zh_hans: 输入新合集名称

# vocabulary.packAll
source: All Words
ja: すべての単語
zh_hans: 全部单词

# vocabulary.packListTitle
source: Word Packs
ja: 単語パック
zh_hans: 单词合集

# vocabulary.packName
source: Pack name
ja: パック名
zh_hans: 合集名称

# vocabulary.packUngrouped
source: Ungrouped
ja: 未分類
zh_hans: 未分组

# vocabulary.renamePack
source: Rename
ja: 名前を変更
zh_hans: 重命名

# vocabulary.renamePackPrompt
source: Enter a new name
ja: 新しい名前を入力
zh_hans: 输入新名称

# vocabulary.resumeReview
source: Resume
ja: 復習を再開
zh_hans: 恢复复习

# vocabulary.retention%lld
source: Retention %lld%%
ja: 記憶保持率 %lld%%
zh_hans: 保持率 %lld%%

# vocabulary.searchPrompt
source: Search words, meanings, readings
ja: 単語・意味・読みを検索
zh_hans: 搜索单词、释义或读音

# vocabulary.startAhead
source: Review Ahead
ja: 先取り復習
zh_hans: 提前复习

# vocabulary.startReview
source: Start Review
ja: 復習を開始
zh_hans: 开始复习

# vocabulary.stateLearning
source: Learning
ja: 学習中
zh_hans: 学习中

# vocabulary.stateMastered
source: Mastered
ja: 習得済み
zh_hans: 已掌握

# vocabulary.stateNew
source: New
ja: 未学習
zh_hans: 未学

# vocabulary.stateReview
source: Reviewing
ja: 復習中
zh_hans: 复习中

# vocabulary.streak
source: Streak
ja: 連続学習
zh_hans: 连续打卡

# vocabulary.todayProgress%lld%lld
source: Today: %1$lld new learned · %2$lld reviews cleared
ja: 今日:新規 %1$lld · 復習 %2$lld クリア
zh_hans: 今日已通过:新词 %1$lld · 复习 %2$lld

# vocabulary.total
source: Total
ja: 合計
zh_hans: 总数

# vocabulary.wordCount%lld
source: %lld words
ja: %lld 語
zh_hans: %lld 个单词

# common.ok
source: OK
zh_hans: 好

# import.method.url
source: URL
zh_hans: 网址
